{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "same", "subsample": [2, 2], "b_constraint": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "activity_regularizer": null, "nb_row": 5, "input_dtype": "float32", "activation": "relu", "dim_ordering": "tf", "name": "convolution2d_1", "init": "glorot_uniform", "trainable": true, "nb_filter": 24}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "same", "subsample": [2, 2], "b_constraint": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5, "activation": "relu", "dim_ordering": "tf", "name": "convolution2d_2", "init": "glorot_uniform", "trainable": true, "nb_filter": 36}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "same", "subsample": [2, 2], "b_constraint": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5, "activation": "relu", "dim_ordering": "tf", "name": "convolution2d_3", "init": "glorot_uniform", "trainable": true, "nb_filter": 48}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "same", "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3, "activation": "relu", "dim_ordering": "tf", "name": "convolution2d_4", "init": "glorot_uniform", "trainable": true, "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "same", "subsample": [1, 1], "b_constraint": null, "b_regularizer": null, "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3, "activation": "relu", "dim_ordering": "tf", "name": "convolution2d_5", "init": "glorot_uniform", "trainable": true, "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 1164, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 1600, "activation": "relu", "name": "dense_1", "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 100, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 1164, "activation": "relu", "name": "dense_2", "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 50, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 100, "activation": "relu", "name": "dense_3", "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 50, "activation": "relu", "name": "dense_4", "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "input_dim": 10, "activation": "tanh", "name": "output", "init": "glorot_uniform", "trainable": true}}]}