{"config": [{"config": {"nb_filter": 16, "batch_input_shape": [null, 80, 320, 1], "activity_regularizer": null, "nb_row": 8, "nb_col": 8, "activation": "linear", "input_dtype": "float32", "bias": true, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "name": "convolution2d_1", "subsample": [4, 4]}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_filter": 32, "b_regularizer": null, "nb_row": 5, "nb_col": 5, "activation": "linear", "bias": true, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "name": "convolution2d_2", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_filter": 64, "b_regularizer": null, "nb_row": 5, "nb_col": 5, "activation": "linear", "bias": true, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "name": "convolution2d_3", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "W_constraint": null, "output_dim": 512, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "input_dim": 6400}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "W_constraint": null, "output_dim": 1, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "input_dim": 512}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}