{"config": [{"config": {"name": "convolution2d_1", "W_regularizer": null, "batch_input_shape": [null, 64, 64, 1], "input_dtype": "float32", "trainable": true, "b_constraint": null, "subsample": [4, 4], "dim_ordering": "tf", "nb_row": 8, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "nb_filter": 16, "nb_col": 8, "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_2", "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "nb_filter": 32, "nb_col": 5, "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_3", "W_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "nb_filter": 64, "nb_col": 5, "border_mode": "same", "activity_regularizer": null, "bias": true, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_1", "W_regularizer": null, "input_dim": 1024, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "output_dim": 512, "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_2", "W_regularizer": null, "input_dim": 512, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "output_dim": 1, "bias": true, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}