{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "nb_filter": 16, "W_constraint": null, "W_regularizer": null, "input_dtype": "float32", "b_regularizer": null, "border_mode": "same", "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "nb_row": 8, "nb_col": 8, "subsample": [4, 4], "name": "convolution2d_1", "batch_input_shape": [null, 66, 200, 3], "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "trainable": true, "nb_filter": 32, "dim_ordering": "tf", "activation": "linear", "nb_row": 5, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_2", "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "trainable": true, "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "nb_row": 5, "nb_col": 5, "subsample": [2, 2], "name": "convolution2d_3", "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dense", "config": {"output_dim": 512, "b_constraint": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 4160, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_constraint": null, "bias": true, "W_regularizer": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 512, "name": "dense_2"}}]}