{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "input_dtype": "float32", "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faM/Users/mohammedamarnah/Desktop/SDCProject/CBM64-SDC/Steering System/models.py\u00da\b<lambda>\t\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}, "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "valid", "subsample": [2, 2], "nb_filter": 24, "nb_row": 5, "activation": "elu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "valid", "subsample": [2, 2], "nb_filter": 36, "nb_row": 5, "activation": "elu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "border_mode": "valid", "subsample": [2, 2], "nb_filter": 48, "nb_row": 5, "activation": "elu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_4", "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "border_mode": "valid", "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "activation": "elu", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_5", "trainable": true, "bias": true, "b_constraint": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_regularizer": null, "activation": "elu", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 1152, "name": "dense_1", "trainable": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_regularizer": null, "activation": "elu", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 100, "name": "dense_2", "trainable": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_regularizer": null, "activation": "elu", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 50, "name": "dense_3", "trainable": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_regularizer": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": 10, "name": "dense_4", "trainable": true, "W_constraint": null, "b_regularizer": null}}], "keras_version": "1.2.1"}