{"config": [{"config": {"subsample": [2, 2], "nb_filter": 24, "bias": true, "activity_regularizer": null, "b_regularizer": null, "nb_col": 5, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "activation": "linear", "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_1", "W_constraint": null, "nb_row": 5, "trainable": true, "dim_ordering": "tf", "border_mode": "same", "batch_input_shape": [null, 64, 64, 1]}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "nb_filter": 36, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_2", "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "border_mode": "same", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "nb_filter": 48, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_3", "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "border_mode": "same", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "nb_filter": 64, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_4", "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "border_mode": "same", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "nb_filter": 64, "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "name": "convolution2d_5", "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "border_mode": "same", "trainable": true}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "output_dim": 1164, "bias": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "b_constraint": null, "name": "dense_1", "input_dim": 4096, "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 100, "bias": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "b_constraint": null, "name": "dense_2", "input_dim": 1164, "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 50, "bias": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "b_constraint": null, "name": "dense_3", "input_dim": 100, "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_8", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 10, "bias": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "b_constraint": null, "name": "dense_4", "input_dim": 50, "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_9", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "output_dim": 1, "bias": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "name": "output", "input_dim": 10, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}