{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "input_dtype": "float32", "name": "convolution2d_1", "nb_row": 5, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "batch_input_shape": [null, 32, 16, 3], "nb_filter": 3}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "name": "convolution2d_2", "nb_row": 5, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "name": "convolution2d_3", "nb_row": 5, "W_constraint": null, "subsample": [2, 2], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "name": "convolution2d_4", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "activation": "relu", "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "name": "convolution2d_5", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "nb_filter": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "relu", "bias": true, "output_dim": 1164, "trainable": true, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 512, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "relu", "bias": true, "output_dim": 100, "trainable": true, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 1164, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "relu", "bias": true, "output_dim": 50, "trainable": true, "name": "dense_3", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 100, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "relu", "bias": true, "output_dim": 10, "trainable": true, "name": "dense_4", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 50, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "tanh", "bias": true, "output_dim": 1, "trainable": true, "name": "output", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 10, "W_regularizer": null}}]}