{"config": [{"config": {"nb_col": 8, "activity_regularizer": null, "nb_row": 8, "name": "convolution2d_1", "border_mode": "same", "trainable": true, "bias": true, "activation": "linear", "batch_input_shape": [null, 64, 64, 1], "input_dtype": "float32", "nb_filter": 16, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "subsample": [4, 4], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 5, "activity_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "border_mode": "same", "trainable": true, "bias": true, "b_regularizer": null, "activation": "linear", "nb_filter": 32, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 5, "activity_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "border_mode": "same", "trainable": true, "bias": true, "b_regularizer": null, "activation": "linear", "nb_filter": 64, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 512, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 1024}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 1, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "bias": true, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 512}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}