{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_1", "input_dtype": "float32", "activity_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "same", "subsample": [2, 2], "init": "glorot_uniform", "b_constraint": null, "nb_filter": 24, "nb_col": 5, "bias": true, "batch_input_shape": [null, 64, 64, 3], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_2", "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "same", "subsample": [2, 2], "init": "glorot_uniform", "b_constraint": null, "nb_filter": 36, "nb_col": 5, "bias": true, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_3", "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "same", "subsample": [2, 2], "init": "glorot_uniform", "b_constraint": null, "nb_filter": 48, "nb_col": 5, "bias": true, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_4", "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "same", "subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "nb_col": 3, "bias": true, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_4", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_5", "W_constraint": null, "activity_regularizer": null, "trainable": true, "border_mode": "same", "subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "nb_col": 3, "bias": true, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_5", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 1164, "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 1600, "init": "glorot_uniform", "b_constraint": null, "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 1164, "init": "glorot_uniform", "b_constraint": null, "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 100, "init": "glorot_uniform", "b_constraint": null, "name": "dense_3", "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 50, "init": "glorot_uniform", "b_constraint": null, "name": "dense_4", "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 10, "init": "glorot_uniform", "b_constraint": null, "name": "output", "b_regularizer": null, "W_regularizer": null, "bias": true, "activation": "tanh"}}]}