{"config": [{"config": {"init": "glorot_uniform", "name": "convolution2d_1", "trainable": true, "bias": true, "b_regularizer": null, "dim_ordering": "tf", "input_dtype": "float32", "W_regularizer": null, "nb_filter": 16, "nb_col": 8, "b_constraint": null, "border_mode": "valid", "subsample": [4, 4], "nb_row": 8, "activity_regularizer": null, "activation": "linear", "batch_input_shape": [null, 80, 320, 1], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "bias": true, "trainable": true, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "nb_filter": 32, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "subsample": [2, 2], "nb_row": 5, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "bias": true, "trainable": true, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "name": "convolution2d_3", "subsample": [2, 2], "nb_row": 5, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "trainable": true, "output_dim": 512, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "bias": true, "input_dim": 2176, "activity_regularizer": null, "activation": "linear", "W_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "trainable": true, "output_dim": 1, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "bias": true, "input_dim": 512, "activity_regularizer": null, "activation": "linear", "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}