{"keras_version": "1.2.1", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 64, 64, 1], "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "bias": true, "border_mode": "same", "activation": "relu", "input_dtype": "float32", "activity_regularizer": null, "nb_filter": 36, "b_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "bias": true, "border_mode": "same", "activation": "relu", "activity_regularizer": null, "nb_filter": 48, "name": "convolution2d_2", "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "bias": true, "border_mode": "same", "activation": "relu", "activity_regularizer": null, "nb_filter": 64, "name": "convolution2d_3", "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "W_constraint": null, "bias": true, "border_mode": "same", "activation": "relu", "activity_regularizer": null, "nb_filter": 64, "name": "convolution2d_4", "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_4", "strides": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "W_constraint": null, "bias": true, "border_mode": "same", "activation": "relu", "activity_regularizer": null, "nb_filter": 128, "name": "convolution2d_5", "dim_ordering": "tf", "b_constraint": null, "W_regularizer": null, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_5", "strides": [1, 1], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "output_dim": 1164, "bias": true, "name": "dense_1", "W_constraint": null, "input_dim": 3200, "b_constraint": null, "W_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "output_dim": 100, "bias": true, "name": "dense_2", "W_constraint": null, "input_dim": 1164, "b_constraint": null, "W_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "bias": true, "name": "dense_3", "W_constraint": null, "input_dim": 100, "b_constraint": null, "W_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "bias": true, "name": "dense_4", "W_constraint": null, "input_dim": 50, "b_constraint": null, "W_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "bias": true, "name": "output", "W_constraint": null, "input_dim": 10, "b_constraint": null, "W_regularizer": null, "activation": "tanh"}, "class_name": "Dense"}], "class_name": "Sequential"}