{"config": [{"config": {"b_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 3, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "batch_input_shape": [null, 32, 16, 3], "W_constraint": null, "bias": true, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null, "input_dtype": "float32", "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 24, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "W_constraint": null, "bias": true, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 36, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "W_constraint": null, "bias": true, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 3, "trainable": true, "nb_filter": 48, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_4", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "W_constraint": null, "bias": true, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "nb_row": 3, "trainable": true, "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_5", "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "W_constraint": null, "bias": true, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 512, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activation": "tanh", "output_dim": 1164, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 1164, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activation": "tanh", "output_dim": 100, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 100, "activity_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "activation": "tanh", "output_dim": 50, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 50, "activity_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "activation": "tanh", "output_dim": 10, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 10, "activity_regularizer": null, "name": "output", "init": "glorot_uniform", "activation": "tanh", "output_dim": 1, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}