{"config": [{"config": {"activity_regularizer": null, "trainable": true, "bias": true, "nb_col": 8, "nb_filter": 16, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_1", "input_dtype": "float32", "b_constraint": null, "subsample": [4, 4], "batch_input_shape": [null, 80, 320, 1], "border_mode": "same", "nb_row": 8, "activation": "linear", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "trainable": true, "nb_col": 5, "bias": true, "nb_filter": 32, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "subsample": [2, 2], "border_mode": "same", "activation": "linear", "nb_row": 5, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "trainable": true, "nb_col": 5, "bias": true, "nb_filter": 64, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "subsample": [2, 2], "border_mode": "same", "activation": "linear", "nb_row": 5, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "input_dim": 6400, "b_constraint": null, "activation": "linear", "output_dim": 512, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "trainable": true, "bias": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "input_dim": 512, "b_constraint": null, "activation": "linear", "output_dim": 1, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}